Autodesk.Revit.DB.RelinquishOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.RelinquishOptions.CheckedOutElements
True means all elements checked out by the current user should be relinquished.
False means none of these are relinquished.
Since:
2014

Autodesk.Revit.DB.RelinquishOptions.UserWorksets
True means all user-created worksets owned by the current user should be relinquished.
False means none of these are relinquished.
Remarks:
This defaults to false in the User Interface.
Since:
2014

Autodesk.Revit.DB.RelinquishOptions.ViewWorksets
True means all view worksets owned by the current user should be relinquished.
False means none of these are relinquished.
Since:
2014

Autodesk.Revit.DB.RelinquishOptions.FamilyWorksets
True means all family worksets owned by the current user should be relinquished.
False means none of these are relinquished.
Since:
2014

Autodesk.Revit.DB.RelinquishOptions.StandardWorksets
True means all project standards worksets owned by the current user should be relinquished.
False means none of these are relinquished.
Since:
2014

Autodesk.Revit.DB.RelinquishOptions.#ctor(System.Boolean)
Constructs a new instance of RelinquishOptions.
relinquishEverything:
The value to apply to all of the members.
Since:
2014

Autodesk.Revit.DB.RelinquishOptions
Options to control behavior of relinquishing ownership of elements and worksets.
Remarks:
The settings correspond to the checkboxes in the Synchronize with Central dialog
in the section "After synchronizing, relinquish the following worksets and elements:".
An element can be owned (reflected in the "Edited By" parameter) either
by being checked out ("borrowed") or by belonging to a checked out workset.
Relinquishing a workset will relinquish all its unmodified elements that the current user owns.
The subtle interactions between checking out elements and checking out worksets
are beyond the scope of the documentation for this class.  But as an example,
if a wall is borrowed (explicitly checked out) and then its workset is checked out,
then the wall is no longer considered borrowed because the workset ownership
implicitly grants ownership of all elements in the workset (except elements borrowed by other users).
Since:
2014